{"version":"https://jsonfeed.org/version/1","title":"TED Vortex","home_page_url":"http://localhost/","feed_url":"http://localhost/feed.json","description":"AI psychologist by day, samurai tooling in general by night. I'm just here to make sure your machines don't develop a personality disorder.","items":[{"id":"http://localhost/revolutionizing-digital-solutions/","url":"http://localhost/revolutionizing-digital-solutions/","title":"Revolutionizing Digital Solutions: Embracing Cross-Platform Efficiency, Robust End-to-End Encryption and Human-Centric AI Analytics","content_html":"<h2 id=\"cross-platform-availability\" tabindex=\"-1\"><a href=\"http://localhost/revolutionizing-digital-solutions/#cross-platform-availability\" class=\"header-anchor\">Cross Platform Availability</a></h2>\n<p>Solutions should have native performance anywhere and everywhere.\nThis simplifies the design process and user experience to a minimum required, keeping our ideas close to the users at all times.</p>\n<p>While our solutions are not IoT centric there is a great benefit for having services flexible across a wide variety of devices.</p>\n<h2 id=\"end-to-end-encryption\" tabindex=\"-1\"><a href=\"http://localhost/revolutionizing-digital-solutions/#end-to-end-encryption\" class=\"header-anchor\">End-to-End Encryption</a></h2>\n<p>We want to build ASAP solutions, that is software As Secure As Possible.\nEnd-to-end encryption is a minimal overhead which becomes automated when implemented in every step of our workflow.</p>\n<p>Compliance with ISO 27XXX has become quite necessary to turn around corporate clients but the necessity to create a company wide security standard exists without the need of business level recognition.</p>\n<h2 id=\"assisted-intelligence-analytics\" tabindex=\"-1\"><a href=\"http://localhost/revolutionizing-digital-solutions/#assisted-intelligence-analytics\" class=\"header-anchor\">Assisted Intelligence Analytics</a></h2>\n<p>While the concept of Artificial Intelligence is interesting human input is always required as they do not think for themselves.</p>\n<p>A mix of machine learning and human pattern review is something we are actively aiming for. A/B testing has been proved to provide beneficial results and machine learning is just one of the means we are using to automate feature testing.</p>\n<h2 id=\"future-proofing\" tabindex=\"-1\"><a href=\"http://localhost/revolutionizing-digital-solutions/#future-proofing\" class=\"header-anchor\">Future Proofing</a></h2>\n<p>Software development has become very unstable with the high influx of new people learning &quot;stuff&quot; and the emerging hybrid specialisations of businesses into the TECH domain, being able to predict software and market development has become tedious and uncertain.</p>\n<p>Most non-native code is a collage of open source dependencies to the point where in average 5% of common written code is <em>real</em>, the rest being a complex dependency tree.</p>\n<p>In reality good software has a certain impact on technology, people and markets. Being able to observe these patterns we are able to make something called &quot;safe decisions&quot;, minimising disaster chance and recovery downtime.</p>\n<h2 id=\"continuous-delivery\" tabindex=\"-1\"><a href=\"http://localhost/revolutionizing-digital-solutions/#continuous-delivery\" class=\"header-anchor\">Continuous Delivery</a></h2>\n<p>Zero downtime, zero stress.</p>\n","date_published":"Mon, 10 Jul 2023 00:00:00 GMT"},{"id":"http://localhost/posts/pine-healthcare-whitepaper/","url":"http://localhost/posts/pine-healthcare-whitepaper/","title":"Pine Healthcare Whitepaper Draft","content_html":"<h2 id=\"hl7-fhir\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#hl7-fhir\" class=\"header-anchor\">HL7 FHIR</a></h2>\n<p>Health Level Seven or HL7 refers to a set of international standards for transfer of clinical and administrative data between software applications used by various healthcare providers. These standards focus on the application layer, which is &quot;layer 7&quot; in the OSI model. The HL7 standards are produced by Health Level Seven International, an international standards organization, and are adopted by other standards issuing bodies such as American National Standards Institute and International Organization for Standardization.</p>\n<p>Hospitals and other healthcare provider organizations typically have many different computer systems used for everything from billing records to patient tracking. All of these systems should communicate with each other (or &quot;interface&quot;) when they receive new information, or when they wish to retrieve information, but not all do so.</p>\n<p>HL7 International specifies a number of flexible standards, guidelines, and methodologies by which various healthcare systems can communicate with each other. Such guidelines or data standards are a set of rules that allow information to be shared and processed in a uniform and consistent manner. These data standards are meant to allow healthcare organizations to easily share clinical information. Theoretically, this ability to exchange information should help to minimize the tendency for medical care to be geographically isolated and highly variable.</p>\n<p>You can read more on:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Health_Level_7\">Wikipedia</a></li>\n<li><a href=\"https://confluence.hl7.org/display/FHIR/Dental+Data+Exchange\">Dental Data Exchange</a></li>\n<li><a href=\"https://www.hl7.org/fhir/codesystem-tooth.html\">FHIR Codesystem</a></li>\n</ul>\n<h2 id=\"electronic-health-records-services\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#electronic-health-records-services\" class=\"header-anchor\">Electronic Health Records Services</a></h2>\n<p>In practice the complexity of the standard and existing health care real life demands and regulations produced a new market niche dedicated to interoperability and FHIR implementations on top of existing software management systems.</p>\n<p>While the highlighted products and companies are in no way affiliated to this paper, they represent various solutions to the interoperability layer <strong>without</strong> enabling the user to own any of his data and medical records:</p>\n<ul>\n<li><a href=\"https://gemmsone.com/index.php?option=com_content&amp;view=article&amp;id=807&amp;Itemid=552\">Gemms</a></li>\n<li><a href=\"https://www.oracle.com/middleware/technologies/soasuite.html\">Oracle SOA</a></li>\n<li><a href=\"https://www.infor.com/products/cloverleaf\">CloverLeaf</a></li>\n<li><a href=\"https://www.magicsoftware.com/integration-solutions/healthcare/\">Magic</a></li>\n<li><a href=\"https://www.cerner.com/pages/careaware\">CareAware</a></li>\n<li><a href=\"https://www.changehealthcare.com/solutions/clinical-network#sort=relevancy&amp;numberOfResults=12\">Change Healthcare</a></li>\n<li><a href=\"https://www.lyniate.com/corepoint/benefits/\">CorePoint</a></li>\n<li><a href=\"https://www.qvera.com/hl7-interface-engine/\">Qvera</a></li>\n<li><a href=\"https://www.nexhealth.com/for/operations\">NexHealth</a></li>\n<li><a href=\"https://www.definitivehc.com/platform#databases\">Definitive Healthcare</a></li>\n<li><a href=\"https://www.redoxengine.com/product/\">Redox</a></li>\n</ul>\n<h2 id=\"pine-motivation\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#pine-motivation\" class=\"header-anchor\">Pine Motivation</a></h2>\n<p>The solution described as Pine is motivated by the fact that open access to patient health records is difficult even when using the vast majority of existing solutions and in similar percentage, centralised.</p>\n<p>When technology is centralized, it typically means that it is controlled and run by a single company, government, or individual. Decentralized technology on the other hand, is run by a network of participants that no one actor can control or shut down. Here are some benefits of decentralization:</p>\n<ol>\n<li><strong>Users don’t have to put trust in a central authority.</strong> We trust companies and governments with our information and money all the time, and it is completely ok to make these decisions on a case by case basis. But we see plenty of examples where this trust lets us down to varying degrees, ranging from the product that you trusted to backup all your photos getting shut down when the startup gets bought or goes out of business, to the social media company selling your data to advertisers who follow you around the internet. In a well designed decentralized network, you should be able to reduce or eliminate the trust that you’re required to put into third parties.</li>\n<li><strong>There is less likely to be a single point of failure.</strong> We see single points of failure all the time in the form of outages of centralized web sites. Gmail goes down and productivity halts as you can’t get your email. Your bank’s web site shuts down for maintenance and you can’t do an online transfer to pay your bills. In decentralized networks, no one node going down can take down the entire network, so no matter how many users come and go, your applications should remain up and running.</li>\n<li><strong>There is less censorship.</strong> It is becoming increasingly common that governments shut down their citizens’ access to social media, as they attempt to censor reports of what is going on internally. It is easy for them to shut down access to Twitter, as all they have to do is stop traffic going to Twitter’s central servers. But it is far more difficult for them to censor traffic on a peer to peer network, in which every single outbound packet being sent could be communicating with another peer on the decentralized network, who can then forward that message along.</li>\n<li><strong>Decentralized networks are more likely to be open development platforms.</strong> This means that anyone can build amazing tools, products, and services on top of decentralized networks. Contrast this with centralized technology which is more often closed off with intentionally limited development opportunities. Open and decentralized doesn’t mean that companies can’t make money. In fact, it means the opposite, as the more great products and tools that are built, the larger the network effects are locking users into the network, and therefore the more opportunities to build great businesses on top. The world wide web itself is a great example of an open network, in which many great businesses such as Amazon, found opportunities to grow enormously due to the network effects of all the great things being built on top of the network.</li>\n<li><strong>There is potential for network ownership alignment.</strong> This is the idea that the people who contribute value to a decentralized network receive ownership or economic stake in the network, that becomes more valuable as the network grows. This is one of the most exciting things that blockchain technology brings to decentralized networks, as it allows economics to be designed into the networks themselves, to create the right incentives for early participants to become powerhouse evangelists and value-contributing users. Contrast this to a centralized network where only the company controlling the network receives value as the network grows, and you can see why it’s exciting for users to participate in a decentralized network.</li>\n<li><strong>Decentralized networks can be more meritocratic.</strong> The best product, service, or content should be more likely to be recognized and rewarded over time when everyone is playing by the same, transparent rules. If traffic, attention, and economics are distributed instead behind a closed, centralized algorithm, it’s possible that the system is less meritocratic.</li>\n</ol>\n<p>One application of public ledgers is the ability to verify identity. In a nutshell, a verifiable credential is a piece of information that a third party can validate digitally.</p>\n<p>Verifiable Credentials is one of the most exciting and transformative areas of innovation. Verifiable Credentials and Decentralized Identifiers help you share your verifiable credentials without giving up your privacy. No one company or institution can control or store your information centrally — you can revoke your verifiable credentials at any time.</p>\n<p>Clinical trial management is another area where blockchains can be of use. For instance, as more laboratories work with large molecules and compounds that originate from various place, an immutable record becomes indispensable for validating information associated to various stages of clinical trials especially when laboratories are located in different parts of the globe.</p>\n<p>In the context of periodontology, multiple actors can verify existing datasets anonymously as well as all the open source code and implementations and we can also apply multiple forms of assisted intelligence to the data sets. While iniatially we are deploying a bias detection and learning algorithm to focus on the researched levels, once the anonimity layer is audited we can apply reinforcement learning to multiple areas impacting user experience.</p>\n<p>Leveraging open access technologies, providers and standards we can give end users complete control over:</p>\n<ul>\n<li>their data and identity</li>\n<li>the way their medical records are used</li>\n<li>which entities can access your information</li>\n<li>which periodontology model to use (insert pine research reference)</li>\n<li>the location where your data is stored (private blockchain, interplanetary file systems)</li>\n</ul>\n<h2 id=\"high-level-architecture\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#high-level-architecture\" class=\"header-anchor\">High level architecture</a></h2>\n<h3 id=\"my-pine-care\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#my-pine-care\" class=\"header-anchor\">My Pine Care</a></h3>\n<p>Main domain for social interactions and public storefront.</p>\n<p>This application is designed to act as a documentation and research centralised hub for all the tools.</p>\n<h3 id=\"pine-dental\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#pine-dental\" class=\"header-anchor\">Pine Dental</a></h3>\n<p><a href=\"https://reactnative.dev/\">React Native</a> open source cross platform client deployed to web, portable ios and android, desktop windows, ubuntu and apple.</p>\n<p>This application is designed to act as a periodontology assistant and research tool.</p>\n<h3 id=\"pine-access\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#pine-access\" class=\"header-anchor\">Pine Access</a></h3>\n<p>De-facto blockchain identity verification and credentials management bridge. Assessment of existing technologies and implementation pending but one implementation quirk of this is the <a href=\"https://web3js.readthedocs.io/en/v1.3.4/\">Web3</a> backend being plugabble to sidechains and private organisations.</p>\n<p>This application is designed to act as a tool to manage access to your private information and records.</p>\n<h3 id=\"pine-backup\" tabindex=\"-1\"><a href=\"http://localhost/posts/pine-healthcare-whitepaper/#pine-backup\" class=\"header-anchor\">Pine Backup</a></h3>\n<p>De-facto blockchain storage solution through <a href=\"https://ipfs.io/\">IPFS</a>. Full access to the storage component is enabled from application launch, however the stability of decentralised solutions, platform, global security and data regulations concerns require this layer to be open to public audit and extension.</p>\n<p>This application is designed to act as a data integrity and encryption solution for all your data spread across public or public chains.</p>\n","date_published":"Wed, 17 Mar 2021 00:00:00 GMT"},{"id":"http://localhost/posts/continuous-integration-and-analysis/","url":"http://localhost/posts/continuous-integration-and-analysis/","title":"Continuous integration and analysis tools for open source nodeJS development","content_html":"<p>Initial idea is based on the list available at https://github.com/ligurio/Continuous-Integration-services/blob/master/continuous-integration-services-list.md.</p>\n<p>It contains only services that provide a sensible amount of features for open source projects or non-profit organisations. I've also added several tools I used or tested with a minimal up and running configuration.</p>\n<p>To summarise the review factors for this document:</p>\n<ul>\n<li>open source tools</li>\n<li>suitable for nodeJS application development</li>\n<li>minimal developer downtime and configuration setback</li>\n<li>fast build times (RAD)</li>\n</ul>\n<h2 id=\"the-list-covers-services-that-can-be-broken-down-into-%22type%22-categories%3A\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#the-list-covers-services-that-can-be-broken-down-into-%22type%22-categories%3A\" class=\"header-anchor\">The list covers services that can be broken down into &quot;type&quot; categories:</a></h2>\n<ol>\n<li><strong><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-integration\">Continuous Integration</a></strong></li>\n<li><strong><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-delivery\">Continuous Delivery</a></strong></li>\n<li><strong><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-analysis\">Continuous Analysis</a></strong></li>\n</ol>\n<p>The list of services can be narrowed down based on main programming language target audience (opinionated):</p>\n<p><strong>NodeJS:</strong></p>\n<ol>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#travis-ci\">Travis</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#snap-ci\">Snap</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#bithound\">Bithound</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#snyk\">Snyk</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#dependency-ci\">Dependency CI</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#coveralls\">Coveralls</a></li>\n</ol>\n<p><strong>Docker:</strong></p>\n<ol>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#wercker\">Wercker</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#codeship\">Codeship</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#buildkite\">Buildkite</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#coveralls\">Coveralls</a></li>\n</ol>\n<p><strong>Ruby:</strong></p>\n<ol>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#codeship\">Codeship</a></li>\n<li><a href=\"http://localhost/posts/continuous-integration-and-analysis/#coveralls\">Coveralls</a></li>\n</ol>\n<h2 id=\"continuous-integration%3A\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-integration%3A\" class=\"header-anchor\">Continuous Integration:</a></h2>\n<h3 id=\"travis-ci\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#travis-ci\" class=\"header-anchor\"><a href=\"https://travis-ci.org/\">Travis CI</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>integrated with virtually every 3rd party</li>\n<li>fast (for ubuntu machines)</li>\n<li>free build matrix</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>local testing version is not free</li>\n<li>missing red hat based distros</li>\n</ul>\n<p><strong>Verdict</strong>: <em><strong>current preferred solution overall.</strong></em></p>\n<h3 id=\"snap-ci\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#snap-ci\" class=\"header-anchor\"><a href=\"https://snap-ci.com/\">Snap CI</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>support for database adaptors</li>\n<li>support for pipes</li>\n<li>support for stages</li>\n<li>bamboo like usage</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>full integration takes some configuration downtime</li>\n</ul>\n<p><strong>Verdict</strong>: This is the current preferred solution for enterprise level applications.</p>\n<h3 id=\"buildkite\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#buildkite\" class=\"header-anchor\"><a href=\"https://buildkite.com/\">Buildkite</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github support</li>\n<li>docker support</li>\n<li>supports multiple db engines</li>\n<li>pipes</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>manual configuration on everything</li>\n</ul>\n<p><strong>Verdict</strong>: Looks like the best overall solution for docker applications but the limitations and level of configuration required makes this service difficult to use for nodeJS applications. When considering microservices and multiple backend technologies this tool shines.</p>\n<h3 id=\"semaphore-ci\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#semaphore-ci\" class=\"header-anchor\"><a href=\"https://semaphoreci.com/\">Semaphore CI</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>latest node development not supported</li>\n<li>no build matrix</li>\n<li>poor integration with other services</li>\n</ul>\n<p><strong>Verdict</strong>: I don't find this service suitable for nodeJS application development.</p>\n<h3 id=\"magnum-ci\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#magnum-ci\" class=\"header-anchor\"><a href=\"https://magnum-ci.com/\">Magnum CI</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket/hosted</li>\n<li>developer flow</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>node 0.10 is highest version</li>\n<li>deployed technologies make the service unmaintainable</li>\n</ul>\n<p><strong>Verdict</strong>: I don't find this service suitable for nodeJS application development.</p>\n<h3 id=\"drone\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#drone\" class=\"header-anchor\"><a href=\"https://drone.io/\">Drone</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket/google code</li>\n<li>support for all web languages</li>\n<li>support for database adaptors</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>node 0.10 is highest version</li>\n<li>deployed technologies make the service unmaintainable</li>\n</ul>\n<p><strong>Verdict</strong>: I don't find this service suitable for nodeJS application development.</p>\n<h2 id=\"continuous-delivery\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-delivery\" class=\"header-anchor\">Continuous Delivery</a></h2>\n<h3 id=\"wercker\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#wercker\" class=\"header-anchor\"><a href=\"http://wercker.com/\">Wercker</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>docker support</li>\n<li>kubernetes support</li>\n<li>pipes</li>\n<li>local testing</li>\n<li>awesome developer flow</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>not very useful for simple NPM packages</li>\n</ul>\n<p><strong>Verdict</strong>: Looks like the most solid continuous integration solution out there. Will test this in production with a react application.</p>\n<h3 id=\"codeship\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#codeship\" class=\"header-anchor\"><a href=\"https://codeship.com/\">Codeship</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>docker native</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>ruby targeted audience</li>\n<li>OSS features limited vastly</li>\n</ul>\n<p><strong>Verdict</strong>: Looks like a solid choice for ruby/docker inspired projects. Performance seems good for small projects. With competitive technologies I would prefer this service for ruby development and asset revision.</p>\n<h3 id=\"shippable\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#shippable\" class=\"header-anchor\"><a href=\"https://app.shippable.com/\">Shippable</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>docker support</li>\n<li>pipes</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>major user experience issues</li>\n<li>unable to select free license</li>\n</ul>\n<p><strong>Verdict</strong>: I would like to use this service ...</p>\n<h3 id=\"factor\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#factor\" class=\"header-anchor\"><a href=\"https://factor.io/\">Factor</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github support</li>\n<li>custom workflow generator</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>ruby based</li>\n<li>lacks open source integrations</li>\n</ul>\n<p><strong>Verdict</strong>: It's only useful in the ruby ecosystem with complex workflows. Most of the features this service offers are provided by several packages and standards via NPM.</p>\n<h2 id=\"continuous-analysis\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#continuous-analysis\" class=\"header-anchor\">Continuous Analysis</a></h2>\n<h3 id=\"bithound\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#bithound\" class=\"header-anchor\"><a href=\"https://www.bithound.io/\">Bithound</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>local version</li>\n<li>code quality</li>\n<li>dependency security advisory</li>\n<li>builds on top of NSP</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>eslint highest supported version is 2.0</li>\n</ul>\n<p><strong>Verdict</strong>: So far very good and fast tool with extremely fast customer support.</p>\n<h3 id=\"snyk\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#snyk\" class=\"header-anchor\"><a href=\"https://snyk.io/\">Snyk</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>github/bitbucket</li>\n<li>local check</li>\n<li>builds on top of nsp</li>\n<li>builds on top of src:clr security advisory</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>monitor command can fail (local backfall)</li>\n</ul>\n<p><strong>Verdict</strong>: Using this tool on top of</p>\n<h3 id=\"dependency-ci\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#dependency-ci\" class=\"header-anchor\"><a href=\"https://dependencyci.com/\">Dependency CI</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>lightning fast setup due to lack of features</li>\n<li>vast number of programming languages supported</li>\n<li>go/julia/swift wow</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>not configurable</li>\n<li>nodeJS purpose is completely superseded by other tools already open source</li>\n</ul>\n<p><strong>Verdict</strong>: This tool is useful for projects that don't have a complete generic stack, for example a plugin theme pushed to NPM might not need complex integrations and this tools would serve well to notify in the rare cases of lost/forgotten packages.</p>\n<h3 id=\"coveralls-cc\" tabindex=\"-1\"><a href=\"http://localhost/posts/continuous-integration-and-analysis/#coveralls-cc\" class=\"header-anchor\"><a href=\"https://coveralls.io/\">Coveralls CC</a></a></h3>\n<p><strong>Pro</strong>:</p>\n<ul>\n<li>support for multiple programming languages</li>\n<li>support for multiple CIs</li>\n</ul>\n<p><strong>Con</strong>:</p>\n<ul>\n<li>local tests are cumbersome</li>\n</ul>\n<p><strong>Verdict</strong>: Using this as part of the LCOV data upload gulp task in parallel with bithound.</p>\n","date_published":"Wed, 22 Jun 2016 00:00:00 GMT"}]}